-- MySQL dump 10.13  Distrib 8.0.28, for macos12.2 (x86_64)
--
-- Host: localhost    Database: PF_development
-- ------------------------------------------------------
-- Server version	8.0.28

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `test_results`
--

DROP TABLE IF EXISTS `test_results`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `test_results` (
  `id` bigint NOT NULL AUTO_INCREMENT,
  `egogram_type` varchar(191) DEFAULT NULL,
  `character` text,
  `stregth` text,
  `weakness` text,
  `people_around_you` text,
  `created_at` datetime(6) NOT NULL,
  `updated_at` datetime(6) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=25 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `test_results`
--

LOCK TABLES `test_results` WRITE;
/*!40000 ALTER TABLE `test_results` DISABLE KEYS */;
INSERT INTO `test_results` VALUES (1,'クールネガティブ','自分をコントロールするのが上手で、いつも一歩引いてクールに状況を判断\r\n自分の得にならないと思うときは、真逆の意見を持っていてもその場の空気に合わせてイエスという傾向があります。\r\nむやみに本音を他人に打ち明けるようなことはしません。感情よりも客観的事実やデータを優先するので、気分で考えがぶれることがなく、いうことや行動に一貫性がある人と言えるでしょう。\r\nまた、厳格さを示すCPが高いので、自分を甘え明かしません。\r\nどんなに苦しくても「まぁいいか！」と手抜きしたりせず、きちんと最後までやり遂げます。\r\n人を裏切ることはなく、規則も厳格に守る傾向があります。\r\nこれらの特徴から、周囲からは「頼り甲斐のある誠実な人」として信頼されているでしょう。\r\n一方、空気を読むので人付き合いは悪くなく、飲み会などにも参加しますが、自分からどんどん人を誘ったり、場を盛り上げたりするキャラクターではありません。\r\nこのタイプにとって「面白いこと」に対しての優先度は低いので、一緒にいて楽しいという印象ではないでしょう。\r\n新しいことや方法にチャレンジするのも得意な方ではありません。\r\n物事をクールに分析して、ちょっとでもリスキーなことには手を出さない防御力高めの性格です。','基本的に真面目なので、コツコツ頑張るのがとても得意です。\r\n大抵の人が逃げ出してしまうような単調な仕事でも黙って頑張り通します。\r\n期日をしっかり守り、ミスも少ないので、上司や目上の人からは右腕として重宝されます。\r\n気分や衝動に左右されないのでいつも規律正しく、常識があり、礼儀が重んじられる公的な場に向いています。\r\nライフプランもしっかりしていて、お金を貯めるのは得意です。','自分に厳しく抑制しているので、当然のように他人にも同じレベルを求めてしまう傾向があります。\r\nその結果、知らないうちに自分のこだわりやルールを人に押し付けてしまうこともあります。\r\nまた、状況をクールに判断するあまり、「どうせ無理」と消極的になりすぎる傾向があります。\r\nストレスを溜め込みすぎると、取り返しがつかないほど大爆発してしまうタイプなので要注意！\r\n','理性的なつもりが、よくわからない人扱いされることがあります。\r\n感情的な話は聞くのもするのも苦手で、もし自分の意見を言って損をしたらどうするかと考えるタイプです。\r\n本音はもちろん、ちょっとした感想ですらなかなか他人に話すことはありません。\r\nしかし、この態度が周りには「いつも黙っていて、何を考えているのかわからないちょっと不思議な人」と思われてしまうことも。\r\nまたアドバイスをしたら「細かい人認定」されることがあります。\r\n一度、成功するとずっとその方法でやり続けるという傾向があります。\r\n絶対に失敗しない安心で確実な方法だから、という考え方です。\r\nそのため、人に物を頼むとき、つい自分の中で持っている「失敗しない確実な方法」をアドバイスしてしまうのですが、それが押し付けがましく取られてしまう可能性があります。\r\n結果だけではなくやり方まで指定してくる、細かくて融通の利かない人だという印象を与えてしまうかも。\r\nまた仕方なくやっていたことがいつの間にか便利な人として扱われることがあります。\r\n自分の評価が下がることには耐えられないので、常に人の顔色や場の空気をとても気にしてしまいます。\r\nそのため、嫌なことや不得意なことでも頼まれれば断れないことがあります。\r\n周りからはとても頼みやすい人に見えてしまい、時に「あの人に頼めばいいや」と便利屋さん扱いされてしまうこともあります。\r\n感情や表情や態度に出ないので、相手はあなたが嫌がっていることに気づかないことも多々あります。','2022-07-04 22:17:03.523283','2022-07-04 22:23:15.543596'),(2,'楽天家','エゴグラムで愛情を示すNPが高く、愛情豊かなタイプ\r\nどんな人に対してもいいところがあると信じている為、思いやりがあり世話好きです\r\n人を憎んだり嫌うことは苦手で、たとえ大嫌いだとしても、少しいい面を見るとすぐに見直す素直な心を持っています\r\nこのタイプの大切にしていることは楽しいことです\r\nそのため、職場でも家庭でも、その場を明るく楽しくしようと盛り上げ役に徹することがよくあります\r\n時に自分を犠牲にしてでも楽しくしようとするので、後悔することもあります\r\nそれでも期待されると楽しくしようと努めます\r\n常に楽しむことを探しており、好奇心と様々なことに大胆なチャレンジをします\r\nそのためこのタイプの人と一緒にいるといろんなことが経験できるので、楽しいと感じる人は多いでしょう\r\n楽しさを最優先にするので、その為ならルールや常識などは二の次になることもあり、ルーズになる傾向があります','サービス精神旺盛なので、周りが楽しくなると思うと惜しまず行動にします\r\nまた良くも悪くも忘れやすいタイプなので、根に持つことがなく、落ち込んでも少し褒めてもらえればまた元気になります','何に対しても見積もりが甘く、楽観的なため計画は穴だらけになりやすいです\r\n気分によって方向転換する面も、無駄が多くなる一因です\r\n一貫性があると言えず、周りの人が振り回されて疲れてしまいます','サービス精神が旺盛な為、たとえば結論が出ずみんなが黙ったままの会議などでは、自らまとめ役を買って出ることも少なくありません\r\nしかし、それを仕切り屋だと感じる人もいます\r\n','2022-07-04 22:18:09.543455','2022-07-04 22:19:21.180283'),(3,'献身','ここに記載\r\nで改行r\r\n','stregth_test','weakness_test',',people_around_you_test','2022-07-04 22:18:10.759835','2022-07-04 22:23:34.603662'),(4,'野心家','ここに記載\r\nで改行r\r\n','stregth_test','weakness_test',',people_around_you_test','2022-07-04 22:18:11.477478','2022-07-04 22:23:46.570931'),(5,'合理的','ここに記載\r\nで改行r\r\n','stregth_test','weakness_test',',people_around_you_test','2022-07-04 22:18:12.339131','2022-07-04 22:23:57.670745'),(6,'きまじめ','ここに記載\r\nで改行r\r\n','stregth_test','weakness_test',',people_around_you_test','2022-07-04 22:18:13.029174','2022-07-04 22:24:10.420998'),(7,'ネガティブ','ここに記載\r\nで改行r\r\n','stregth_test','weakness_test',',people_around_you_test','2022-07-04 22:18:13.674284','2022-07-04 22:24:23.827995'),(8,'天真爛漫','ここに記載\r\nで改行r\r\n','stregth_test','weakness_test',',people_around_you_test','2022-07-04 22:18:14.266333','2022-07-04 22:24:37.180650'),(9,'頑固一徹','思い込んだら一直線で、自分に与えられた使命を果たすため、脇目も振らず前へ進むタイプです\r\n融通が効かず、まさに頑固一徹という言葉が当てはまる性格です\r\n曲がったことは大嫌いで、何事もきちんと筋を通すべきだと考えています\r\n人付き合いにおいても、義理人情に厚く、礼儀に適ったスタイルを理想としています\r\n養育的な優しさや保護性を示すNPが高めなので、かなり面倒見が良いのもこのタイプの特徴です\r\n自分をリスペクトしてくれたり、懐いてくれる後輩や部下にはまるで親のような大きな愛情を持ってしっかりと面倒を見てあげるでしょう\r\n不器用でなんでも一度こう決めたらなかなか変更しません\r\n人にあれこれ指摘されると余計に意固地になってしまう面もあります\r\n融通が効く性格の人や若い人からは「堅苦しい、気難しい」と敬遠される傾向があります\r\n逆に年配の人からのウケはいいですし、「今時に珍しい、芯のしっかりした人」として評価してもらえるでしょう','自分を甘やかすことなく、いつも全力を尽くします\r\n締め切りやクオリティに関しても、高い責任感と職人気質な性格で、相手が求める以上のレベルで答えることができます\r\n途中で物事を投げ出したり、約束を破るようなことは絶対にない、誠実で頼り甲斐のある性格です\r\nこのタイプに頼ればなんとかなる、と思って当てにしている人も多いはずです','自分が取り組んでいることが山場に差し掛かったり、修羅場になったりすると、それに打ち込みすぎて全く周りが見えなくなってしまします\r\n日頃からマイペースな傾向はありますが、こうなると職場でのチームワークや、家庭への配慮も全部忘れ去って、一心不乱に没頭します\r\nこういう状態が何ヶ月も続くことも珍しくありません\r\nやっと一段落ついて顔を上げた時には、周囲の人が愛想をつかしてしまっていることもあるでしょう','抱えた課題は一生懸命こなすのが当然でちゃんとした使命感を持って、それなりの成果が出るまでは頑張るべきだと考えています\r\n必要とあれば、寝食を忘れて、必死に没頭することもためらいません\r\nこの職人気質なスタイルが、人によっては「誰からもそこまで言われてないのに、あなたは独りよがりだよね」と思われてしまうこともあります\r\nこのタイプには「社会で生きる異常は、筋と道理は当然通すべき」という概念が生まれつき備わっています\r\n電話は自分から名乗る、物を頼むときはきちんと状況を説明する、何かあったらまず上司に相談する、約束は守る、返信は必ずする、一度口に出したことは実行する、お礼と報告は欠かさないなど、どれも基本的なことで難しいことは一つもありません\r\nしかし、履歴書をパソコンで作り、アプリで業務連絡をする世代からは通用せず、「古い」と思われている恐れがあるでしょう\r\n休みの日でも別に遊びに行かなくて良く、家で仕事の準備や家事をして「自分のメンテナンス」をしていた方が安らげると思うタイプ\r\n仕事も家事も一生懸命やればいろんな面白みがある物だと、それだけで十分毎日充実して楽しいと本心から思っています\r\nしかし、遊びや趣味のない、寂しい生活を送っている人に見えてしまうことがあるようです\r\n','2022-07-04 22:18:14.846093','2022-07-04 22:33:15.054332'),(10,'駄々っ子','奔放さと子供らしさを示すFCが突出して高いことがこのタイプの性格を大きく方向付けています\r\n大事なことは、今自分がしたいことをすること、本能の赴くまま、欲望に忠実に生きています\r\n後先や損得は考えないので、ある意味で刹那的とも言えるでしょう\r\nやりたいと思ったらなんとしてもやる、欲しいと思ったものは手に入れないと気が済まない、という性格です\r\n社会の常識や義理人情に縛られて我慢するということは、このタイプには見られません\r\nひらめきと直感で行動が決まるので、自分でも自分のことが予想できませんが、周囲はもっとそう感じています\r\n「次は何をやらかすんだろう？」と思われていることも少なくないでしょう\r\n好奇心が旺盛で感受性が高く、明るいのが特徴です\r\nまた、寂しがりでもあり、人に好かれていたい、褒められたいという気持ちが強く、逆に嫌なことは論理的な話や重い責任です\r\n嫌いなことはカットして、もっと楽に楽しくしたいと思っています\r\nただ、自分にそういう側面が欠けているという自覚は持っています\r\n責任感を示すCPの高いタイプ、論理性に優れるAの高いタイプに対しては、安心を感じるので一緒にいたいと思うでしょう\r\n本能に忠実なので、好きと思う気持ちをコントロールするのが苦手です\r\n不倫関係に陥りやすいタイプなので注意が必要です\r\n','一旦やりたいと思ったら立ち止まることはありません\r\nどんなに道な世界にでも躊躇うことなく飛び込んでいく、抜群の実績力があります\r\nダラダラと迷ったりせず、強い好奇心で次々にやりたいことが湧いてきます\r\n自分で体験して楽しむタイプなので、話題の多い人でもあります','「自分がやりたいかどうか」が全ての判断基準なので、ルールや習慣を破るつもりはないのですが、疎かになりがちです\r\n仕事と遊びとの公私混同による周囲からの批判されることもあります\r\nやりたいことしかやらない性格とも相まって、お堅い会社勤めは向いているとは言えません\r\n','せっかくの楽しいことは人と一緒にやりたいと思っており、一人だと楽しさが半減というように思っています\r\n自身は単純にそう思っているだけなのですが、「自己中」だと思われやすい側面でもあります\r\n「自分のやりたいことに、寂しいからという理由だけで人を突き合わせようとする人」という印象を与えるのが原因のようです\r\n自分の気が向いたことには手が早いですが、逆に気の向かないことには少しもやる気が起きないタイプです\r\n例えるならお子様ランチの好きなおかずだけを食べているように、気の向くことばかりやって、その他のことは全部後回しするという傾向があります\r\nこの気が向くかどうかが周りの人からはわからないので、会社組織のようなところではわがままな使いづらい人だと尾も荒れてしまう恐れがあるでしょう\r\nやってみたいと思ったことはすぐにやってみたい、人生一度きりだから興味のあることに挑戦しないでどうするの？と考えがちなタイプなため、職場も果敢に変える傾向が見られます\r\nこのタイプにとって終身雇用は大した魅力ではありません\r\n時には人が驚くような転職回数になることもあり、それでいい加減な人というイメージを抱かれることがあります','2022-07-04 22:18:15.390231','2022-07-04 22:33:50.427562'),(11,'パーフェクト','何をやっても人並み以上に上手くいき、一言で言うとスーパーエリートです\r\n厳しさ、責任感、優しさ、論理性、奔放さ、人を気遣う心はどれも色が濃くでます\r\nしかし、エゴグラムの各要素のアクの強いところ同士がお互いに打ち消し合うので、結果的にバランスの取れた性格になっています\r\nまた言動や行動に偏ったところがなく、世渡りがとてもうまいでしょう\r\nバランスがいい上に目立ちたがりではないので、初めの方は周りから平凡な人と思われがちです\r\nですが、判断や感情表現が他の人と違うことがだんだんと周りの見る目が変わることが多いです\r\n元々全てを兼ね備えているので、深く悩んだことはなく、逆に世間の人が悩んでいることに対し理解があまりできないです\r\nこのタイプの人は褒められても空気のような為、あまりありがたく思わないのですが、全くないのも違和感を覚えることもあります\r\nこのことが周りから偉そうと印象を持たれるでしょう\r\nまた、物事がうまくいかないときは、他人に原因を求めます','どんな仕事もトップクラスに成果を出すことができます\r\n自分の好き嫌いややりたいことも的確に判断し、選び取ることができるでしょう\r\nどんな道でも選ぶことができるでしょう','weakness_test',',people_around_you_test','2022-07-04 22:18:15.932532','2022-07-04 22:25:27.744700'),(12,'平凡','ここに記載\r\nで改行r\r\n','stregth_test','weakness_test',',people_around_you_test','2022-07-04 22:18:16.455977','2022-07-04 22:25:39.721684'),(13,'無欲','ここに記載\r\nで改行r\r\n','stregth_test','weakness_test',',people_around_you_test','2022-07-04 22:18:17.033203','2022-07-04 22:25:50.402260'),(14,'お気楽','ここに記載\r\nで改行r\r\n','stregth_test','weakness_test',',people_around_you_test','2022-07-04 22:18:17.535150','2022-07-04 22:26:01.560153'),(15,'クール','ここに記載\r\nで改行r\r\n','stregth_test','weakness_test',',people_around_you_test','2022-07-04 22:18:18.066442','2022-07-04 22:26:13.593139'),(16,'直感行動','ここに記載\r\nで改行r\r\n','stregth_test','weakness_test',',people_around_you_test','2022-07-04 22:18:18.590847','2022-07-04 22:27:28.318723'),(17,'クローズド','ここに記載\r\nで改行r\r\n','stregth_test','weakness_test',',people_around_you_test','2022-07-04 22:18:19.096491','2022-07-04 22:27:40.020566'),(18,'熱血','ここに記載\r\nで改行r\r\n','stregth_test','weakness_test',',people_around_you_test','2022-07-04 22:18:19.635410','2022-07-04 22:27:48.222475'),(19,'堅実','ここに記載\r\nで改行r\r\n','stregth_test','weakness_test',',people_around_you_test','2022-07-04 22:18:20.152283','2022-07-04 22:27:57.224691'),(20,'お人好し','ここに記載\r\nで改行r\r\n','stregth_test','weakness_test',',people_around_you_test','2022-07-04 22:18:20.657395','2022-07-04 22:28:06.267320'),(21,'理屈','ここに記載\r\nで改行r\r\n','stregth_test','weakness_test',',people_around_you_test','2022-07-04 22:18:21.148831','2022-07-04 22:28:14.216012'),(22,'自由奔放','ここに記載\r\nで改行r\r\n','stregth_test','weakness_test',',people_around_you_test','2022-07-04 22:18:23.889224','2022-07-04 22:28:22.817165'),(23,'ナイーブ','ここに記載\r\nで改行r\r\n','stregth_test','weakness_test',',people_around_you_test','2022-07-04 22:18:24.868364','2022-07-04 22:28:31.699570'),(24,'どれにも当てはまりません','どれにも当てはまりません','どれにも当てはまりません','どれにも当てはまりません','どれにも当てはまりません','2022-07-04 22:18:28.886772','2022-07-04 22:29:06.255392');
/*!40000 ALTER TABLE `test_results` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2022-07-04 22:34:23
